[
  {
    "id": 1,
    "companyName": "BYSL Global Technology Group",
    "companyLogo": "Assets/Images/Company/bysl.png",
    "position": "UI/UX Developer",
    "start": "February,2022",
    "end": "present",
    "location": "Dhaka,Bangladesh",
    "description": "BYSL Global Technology Group is a next-generation technology conglomerate.The group operates as an integrated business ecosystem with investments in multiple brands, industries, markets, and supply chains. A fast-growth organization built on a forward-thinking culture of learning, teamwork, and integrity, embracing change and fueling innovation.",
    "responsibilities": [
      "Translate user behavior and research into actionable data",
      "Make ideas, wireframes, and mockups that lead to intuitive client encounters",
      "Design and create mockups and client ventures for many gadgets including mobile",
      "Gather and evaluate user requirements in collaboration with product manager / project manager and front-end developers",
      "Develop UI mockups and prototypes that clearly illustrate how sites function and look like",
      "Identify and troubleshoot UX problems",
      "Conduct layout adjustments based on user feedback",
      "Design, build, and maintain highly reusable React, JavaScript, HTML and CSS code"
    ],
    "skills": []
  },
  {
    "id": 2,
    "companyName": "Tech Hack Limited",
    "companyLogo": "Assets/Images/Company/techhack.png",
    "position": "Front-end Developer",
    "start": "September,2021",
    "end": "February,2022",
    "location": "Dhaka,Bangladesh",
    "description": "Techhack is a Canadian startup. It's a developer hiring platform. Initially, there is a plan that Canadian companies can hire developers from Bangladesh, but later that plan-track change to launch it on a larger scale. Various assessments are arranged for the developers. After completing the assessment, the recruiter will get an idea about the skills of a developer. I was appointed as a front end developer in this company.",
    "responsibilities": [
      "Understanding the user experience",
      "Prototyping the flow with figma",
      "Planning and Implementation of Project Flow",
      "Converting the UI part with React.js, Material UI",
      "Creating reusable component with React.js",
      "Ensure responsiveness for every screen",
      "Rest api integration",
      "Collaborating with backend development team"
    ],
    "skills": [
      "Material-UI",
      "JavaScript",
      "React.js",
      "REST APIs",
      "UI Design",
      "UX Research"
    ]
  },
  {
    "id": 3,
    "companyName": "Antaranga Dot Com Ltd.",
    "companyLogo": "Assets/Images/Company/antbd.png",
    "position": "NOC Engineer",
    "start": "November,2020",
    "end": "September,2021",
    "location": "Dhaka,Bangladesh",
    "description": "Antaranga Dot Com Limited is a well-known Internet service provider in Bangladesh. They have more than 10000 clients in Dhaka city to whom they provide top-notch level internet services. Along with home clients, they offer Internet services to resellers in several districts outside Dhaka, provide assistance with the latest technology and the best branded devices. I worked on their core network for over a year as a Network Operation Center (NOC) executive.",
    "responsibilities": [
      "Layer 2 Switch Configure, Maintain, Troubleshoot",
      "Mikrotik Configure, Maintain, Troubleshoot",
      "Design FTTX network from scratch",
      "FTTX device like OLT, ONU configure, Maintain, Troubleshoot",
      "Bandwidth Management",
      "VLAN Configure",
      "Network monitoring with DUDE, Cacti, NMS, Nagios",
      "Wireless Devices configure, troubleshoot"
    ],
    "skills": [
      "Cisco Networking",
      "Mikrotik",
      "LAN Switching",
      "VLAN",
      "Fiber to the x (FTTx)",
      "Switching",
      "Bandwidth Management"
    ]
  },
  {
    "id": 4,
    "companyName": "Antaranga Dot Com Ltd.",
    "companyLogo": "Assets/Images/Company/antbd.png",
    "position": "Support Engineer",
    "start": "December,2018",
    "end": "November,2020",
    "location": "Dhaka,Bangladesh",
    "description": "Antaranga Dot Com Limited is a well-known Internet service provider in Bangladesh. They have more than 10000 clients in Dhaka city to whom they provide top-notch level internet services. Along with home clients, they offer Internet services to resellers in several districts outside Dhaka, provide assistance with the latest technology and the best branded devices. I worked on their office branch ( at Banasree ) as a Support Engineer.",
    "responsibilities": [
      "Design and Maintain a full residential area network",
      "Maintain the FTTx Devices and Configure if needed",
      "Maintain Mikrotik router and report assigned area IN charge if any difficulties founded",
      "Handling clients problems and giving them proper support",
      "Maintain local/field support team"
    ],
    "skills": [
      "Mikrotik",
      "Wireless Networking",
      "Fiber to the x (FTTx)",
      "Network Design"
    ]
  }
]
