[
  {
    "id": 1,
    "title": "My early life",
    "description": "I am filled with memories of my hometown in Khustia, Bangladesh. I was born on October 8, 1993, and grew up in a close-knit family of three, including my parents, & sister. In September 2021, I got married and added a new chapter to my life story. I completed my studies in Chittagong and now reside in Dhaka for professional purposes. Despite being far from my hometown, I always carry with me the love and values that were instilled in me during my upbringing in Khustia."
  },
  {
    "id": 2,
    "title": "My education",
    "description": "Continuing my early life story, I received my education in Bangladesh. In 2009, I completed my school education at Housing & Settlement Public School. I then went on to complete my college education at BEPZA Public School & College. I am proud to say that I am a graduate of the University of Science and Technology Chittagong, where I studied Computer Science & Engineering. This education provided me with the foundation and skills necessary to pursue my professional goals."
  },
  {
    "id": 3,
    "title": "Job Life",
    "description": "I began my career as a support engineer at Antaranga Dot Com Limited in the end of 2018. I worked hard and was eventually promoted to a Network Operation Center Engineer in 2020.In 2021, I decided to change my career path and moved from being a network engineer to a front-end developer. I was hired by Techhack Canada as a front-end developer for a startup project. After successfully completing that project, I joined BYSL in 2022 as a UI/UX Designer & Developer. I am proud of my professional journey and the opportunities I have had to grow and develop in my career. I am always seeking new challenges and ways to enhance my skills and knowledge in the field."
  },
  {
    "id": 4,
    "title": "Tech Stack",
    "language": [
      { "id": 1, "title": "JavaScript", "img": "Assets/Images/js.png" },
      { "id": 2, "title": "HTML5", "img": "Assets/Images/html5.jpg" },
      { "id": 3, "title": "CSS3", "img": "Assets/Images/css3.webp" }
    ],
    "jsUi": [
      { "id": 1, "title": "React Js", "img": "Assets/Images/react.png" }
    ],
    "frontEndFrameworks": [
      { "id": 1, "title": "BootStrap", "img": "Assets/Images/bootstrap.png" },
      { "id": 2, "title": "Material UI", "img": "Assets/Images/mui.png" }
    ],
    "uiux": [
      { "id": 1, "title": "Figma", "img": "Assets/Images/figma.jpg" },
      { "id": 2, "title": "Adobe XD", "img": "Assets/Images/xd.png" }
    ],
    "graphicDesign": [
      { "id": 1, "title": "Adobe Photoshop", "img": "Assets/Images/ps.webp" },
      {
        "id": 2,
        "title": "Adobe Illustrator",
        "img": "Assets/Images/illustrator.png"
      }
    ],
    "webHosting": [
      { "id": 1, "title": "Netlify", "img": "Assets/Images/netlify.png" }
    ]
  }
]
